Tekla Open API Reference for Tekla Structures 2025
BaseWeld.WeldPlacementTypeEnum Enumeration
 Weld placement types.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum WeldPlacementTypeEnum
Public Enumeration WeldPlacementTypeEnum
Members
Member name | Value | Description
PLACEMENT_AUTO | 0 |  Auto placement.
PLACEMENT_MAIN | 1 |  Main part placement.
PLACEMENT_SECONDARY | 2 |  Secondary part placement.
See Also
Reference
Tekla.Structures.Model Namespace